Revit 2027 API
Application.NewFamilyInstanceCreationData(Face, Line, FamilySymbol) Method
Creates an object which wraps the arguments of NewFamilyInstance() for batch creation.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilyInstanceCreationData NewFamilyInstanceCreationData(
	Face face,
	Line position,
	FamilySymbol symbol
)
Public Function NewFamilyInstanceCreationData (
	face As Face,
	position As Line,
	symbol As FamilySymbol
) As FamilyInstanceCreationData
public:
FamilyInstanceCreationData^ NewFamilyInstanceCreationData(
	Face^ face,
	Line^ position,
	FamilySymbol^ symbol
)
member NewFamilyInstanceCreationData :
        face : Face *
        position : Line *
        symbol : FamilySymbol -> FamilyInstanceCreationData
Parameters
face Face
A face of a geometry object.
position Line
A line on the face defining where the symbol is to be placed.
symbol FamilySymbol
A FamilySymbol object that represents the type of the instance that is to be inserted.
Return Value
FamilyInstanceCreationData
See Also
Reference
Application Class
NewFamilyInstanceCreationData Overload
Autodesk.Revit.Creation Namespace